# FluidTemperatureSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidTemperatureSetIterator Class
Members See Also
---
An iterator to a set of FluidTemperature from FluidType.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class FluidTemperatureSetIterator : IEnumerator<FluidTemperature>
```

Visual Basic
---
```text
Public Class FluidTemperatureSetIterator _
	Implements IEnumerator(Of FluidTemperature)
```

Visual C++
---
```text
public ref class FluidTemperatureSetIterator : IEnumerator<FluidTemperature^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..FluidTemperatureSetIterator
# See Also
FluidTemperatureSetIterator Members
Autodesk.Revit.DB.Plumbing Namespace